<html>
	<head>
		<title>Anonimato in rete - Pagare Online</title>
		<link rel="stylesheet" type="text/css" href="../css/stile.css">
		<link rel="stylesheet" type="text/css" href="../css/indice.css">
	</head>
	<body>
		<div id="footer">
			<p class="console">
				<a href = "darknet.html"> <span id = "sinistra"> Acquistare nella DarkNet </span> </a> |
				<a href = "../index.html"> <span id = "centro"> Torna all'indice </span> </a> |
				<a href="vulne.html"> <span id = "destra"> Vulnerabilit&agrave; </span> </a>
			</p>
		</div>

		<div>
			<div id="indice">
				<p class="menu1"><a href="#Acquistare">Pagare Online</a></p>
				<ul>
					<li><p class="menu2"><a href="#Cryptomonete">Cryptomonete</a></p></li>
					<li><p class="menu2"><a href="#Bitcoin">Bitcoins</a></p></li>
					<li><p class="menu2"><a href="#Ottenere">Come ottenere i bitcoin</a></p></li>
					<li><p class="menu2"><a href="#Rendere">Rendere irrintracciabili i bitcoin</a></p></li>
				<ul>
					<li><p class="menu3"><a href="#Mixing">Mixing Service</a></p></li>
					<li><p class="menu3"><a href="#CoinJoin">CoinJoin</a></p></li>
				</ul>
			</div>

			<div>
				<h1><a name="Acquistare">Pagare ONline</a></h1>
				<p class="paragrafo">
					Ogni criminale che si rispetti ha il suo giro di compravendita: skimmer, tessere e
					documenti, sim anonime, schede di rete e via dicendo. Sarebbe per&ograve; davvero un
					peccato se venisse beccato direttamente in casa, non vi pare?
				</p>
			</div>

			<div>
				<h2><a name="Cryptomonete">Cryptomonete</a></h2>
				<p class="paragrafo">
					Per i pagamenti invece soni le criptomonete il metodo di pagamento
					accettato dalla communit&agrave;.<br><br>

					!!Precazioni sull'uso della Cryptomoneta!!<br><br>

					Ovviamente dipende dalla cryptomoneta ma ricordatevi che in quasi tutte le
					strutture di questo tipo i trasferimenti sono di dominio pubblico quindi se si
					conosce il proprietario di un address automaticamente si risale ai suoi movimenti
					(legali o meno). La cosa pi&ugrave; stupida che si possa fare &egrave; quindi sbandierare
					ai quattro venti un address di pagamento che viene utilizzato per compravendite dubbie.
				</p>
			</div>

			<div>
				<h2><a name="Bitcoin">Bitcoins</a></h2>
				<p class="paragrafo">
					Il Bitcoin &egrave; la cryptovaluta pi&ugrave;famosa della rete, permette
					con le giuste protezioni di effettuare compravendite in anonimato e al di
					fuori del controllo di Stati e Banche. La struttura e decentralizzata per
					evitare attacchi alla infrastrutture dove sono memorizzate.<br>
					Parleremo dei Bitcoin in quanto sono socialmente i pi&ugrave; accettati nella rete:
					<ul>
						<li>I Bitcoin sono divisibili: avere un Bitcoin oggi vuol dire avere centiania
							di euro la valuta pi&ugrave; usata infatti e il mBTC,</li> (0.001 BTC),</li>
						<li>Bitcoin &egrave; opensource: il codice sorgente del software &egrave; aperto a
							modifiche e disponibile per chiunque,</li>
						<li>Bitcoin &egrave; (quasi) anonimo: tutte le transazioni sono pubbliche ma &egrave;
							possibile risalire solo agli indirizzi.</li>
					</ul>
				</p>
			</div>

			<div>
				<h2><a name="Ottenere">Come ottenere i bitcoin</a></h2>
				<p class="paragrafo">
					&Egrave; possibile ottenere i Bitcoin fondamentalmente in due modi:
					<ul>
						<li>Generandoli: nel gergo informatico questo processo viene definito
								Mining. La cryptomoneta nasce come valuta distribuita e per essere creata viene appunto
								“minata”. Scaricando il software di mining &egrave; possibile creare della vera e propria
								valuta che &egrave; possibile poi spendere per acquistare beni e servizi.</li>
						<li>Acquistandoli: questo &egrave; ovviamente il metodo pi&ugrave; semplice. Esistono diversi
								mercati delle cryptomonete che commerciano qualunque tipo di cryptovaluta.
								Uno dei portali pi&ugrave; popolati &egrave;
								<a href="http://localbitcoins.com">LocalBitcoins</a>
								In alcuni forum (come <a href="http://inforge.net">Inforge</a>
								&egrave; possibile acquistarli dai vari utenti tramite metodo di escrow.</li>
						<li>Scambiandoli: i Bitcoin possono essere anche utilizzati come merce di scambio
								per altre valute . Siti come <a href="http://btc-e.com">BTC-E,</a>
								<a href="http://bitstamp.net">bitstamp,</a>
								<a href="http://coinbase.com">coinbase</a>
						</ul>
						Gli ultimi per&ograve; non sono anonimi poich&egrave; richiedono informazioni personali
						come passaporti o licenze di guida. Inoltre sono molti i servizi che gestiscono la
						piattaforma con wallet online, uno di questi nel 2014 chiuse per bancarotta e
						fece perdere 387 milioni di dollari ai suoi clienti.</p>
					</div>

					<div>
						<h2><a name="Rendere">Rendere irrintracciabili i bitcoin</a></h2>
						<p class="paragrafo">
							Il Bitcoin &egrave; spesso chiamato 'la moneta digitale anonima'. Questa affermazione
							&egrave; sbagliata in due punti:
							<ol>
								<li>Non &egrave; una moneta, &egrave; una valuta</li>
								<li>Non &egrave; anonima (o non lo &egrave; naturalmente)</li>
							</ol>
							Ogni singola transazione Bitcoin viene tracciata: per rendersene conto basta
							visitare il sito <a href="http://blockchain.info">BlockChain.</a>
							Se acquistate dei Bitcoin (o ne vendete) vedrete la vostra transazione in chiaro sul sito.
						</p>
					</div>

					<div>
						<h4><a name="Mixing">Mixing Service</a></h2>
							<p class="paragrafo">
							Uno dei modi per farlo &egrave; quello di utilizzare un contenitore condiviso di
							Bitcoin chiamato servizio di mixing: n pratica tutti gli utenti di un servizio
							mettono assieme i loro Bitcoin, quindi li fanno girare in diverse transazioni
							“mischiando” le carte. Il sistema funziona depositando una cifra: questa viene
							applicata una tariffa che varia da 1-3% questa compiera circa 6 transazione
							prima di essere di nuovo disponihbile.<br><br>

							Molto pi&ugrave; semplicemente l'utente, registrato invia i Bitcoin a un
							servizio di mixing: essi si occuperano di farli girare rendendoli anonimi.<br><br>

							Nel web esistono progetti molto interessanti che si occupano di far ci&ograve;
							<a href="http://gramshelix.com">Gram Shelix,</a>
							<a href="http://bitcoinblender.net">Bitcoin Blender,</a>
							<a href="http://bitcoinmix.org">Bitcoin Mix,</a>,
							PayShield,
							<a href="http://bitcoin-fog.org">Bitcoin Fog,</a>
							<a href="http://coinmixer.seo">Coin Mixer,</a>
							<a href="http://spacechain.io">Space Chain.</a>
							La loro qualit&agrave; ed affidabilit&agrave; dipende non solo dalla seriet&agrave;
							del servizio ma anche, e soprattutto, dal modo in cui vengono utilizzati.<br><br>

							Ogni servizio di mixing gestisce a modo suo le transazioni e tutto il resto.
							Ad ogni modo la logica del mixing e la seguente:
							<ol>
								<li>Creiamo un wallet nella clearnet (lo chiameremo A)</li>
								<li>Inviamo acquistandoli o trasferendoli bitcoin ad A</li>
								<li>Creiamo un secondo wallet, stavolta tramite TOR o circuiti analoghi (B)</li>
								<li>Inviamo i bitcoin da A a B </li>
								<li>Inviamo i bitcoin da B all'indirizzo Bitcoin creato dal Mixer</li>
								<li>Creiamo un nuovo wallet (C) e facciamo inviare l&iacute; i nostri Bitcoin</li>
								<li>In caso di compravendita, possiamo inviare direttamente i bitcoin da B  al
									venditore (controllate le percentuali del mixer!)</li>
							</ol>
						</p>
					</div>

					<div>
						<h4><a name="CoinJoin">CoinJoin</a></h2>
							<p class="paragrafo">
								Nel mondo dei Bitcoin esiste un altro modo per lavare i Bitcoin: il CoinJoin &egrave; un
								metodo di compressione di una transazione di bitcoin che &egrave; stato pensato per
								aumentare la privacy delle parti, rimuovendo le informazioni non necessarie
								della transazione.<br>
								Il CoinJoin &egrave; stato creato poich&egrave; i Bitcoin sono da tempo sponsorizzati
								come strumento anonimo di pagamento, in realt&agrave; e tutt'altro che blindato anzi
								si potrebbe dire che &egrave; pi&ugrave; sicura una banca poich&egrave; almeno le
								transazioni non sono di dominio pubblico!<br><br>

								Il metodo del CoinJoin consiste semnplicemente nel collegarsi ad un server
								che funge da punto di ritrovo di tante persone che partecipano alla stessa transazione
							  rendendo pi&ugrave; difficile stare dietro a tutti i pagamenti. A differenza dei mixing services,
								i Bitcoin non possono essere rubati... <br><br><br>

								La cryptomoneta pu&ograve; essere anche utilizzata per altri scopi oltre agli acquisti in
								anonimato: tra i metodi pi&ugrave; accreditati vi troviamo l'evasione fiscale e il
								riciclaggio di denaro. Infatti in molte nazioni e illegale (italia esclusa). Si pensa
								infatti che in futuro prossimo le cryptovalute verrano rimosse.
							</p>
						</div>
					</div>
				</div>

				<div id="footer">
					<p class="console">
						<a href = "darknet.html"> <span id = "sinistra"> Acquistare nella DarkNet </span> </a> |
						<a href = "../index.html"> <span id = "centro"> Torna all'indice </span> </a> |
						<a href="vulne.html"> <span id = "destra"> Vulnerabilit&agrave; </span> </a>
					</p>
				</div>
			</body>
		</html>
