<html>
	<head>
		<title>Anonimato in rete - Vulnerabilit&agrave; </title>
		<link rel="stylesheet" type="text/css" href="../css/stile.css">
		<link rel="stylesheet" type="text/css" href="../css/indice.css">
	</head>
	<body>
		<div id="footer">
			<p class="console">
    				<a href="pagareonline.html"><span id = "sinistra"> Pagare Online </span></a> |
    				<a href = "../index.html"> <span id = "centro">Torna all'indice </span> </a> |
    				<a href="ambienti.html"><span id = "destra"> Ambienti Virtualizzati </span></a>
          </p>
        </div>

        <div>
          <div id="indice">
            <p class="menu1"><a href="#Vulnerabilita">Vulnerabilit&agrave;</a></p>
    				<ul>
    					<li><p class="menu2"><a href="#Precauzioni">Precauzioni generali</a></p></li>
            </ul>
        </div>
        <div id="contenuto">
    			<h1><a name="Vulnerabilit&agrave;">Vulnerabilit&agrave;</a></h1>
    			<p class = "paragrafo">
            Per quanto tu possa aver preso tutte le contromisure necessarie per essere
            anonimo, purtroppo nell'informatica esiste sempre la possibilit&agrave;
            che tu sia una vittima.<br>
            Non dovrebbe essere un segreto che il governo degli Stati Uniti
            &egrave; il pi&ugrave; grande acquirente di vulnerabilit&agrave; ancora non scoperte
            (le cosiddette 0day).
          </p>
        </div>

        <div>
          <h2><a name="Precauzioni">Precauzioni generali</a></h2>
          <p class = "paragrafo">
            Per esempio un malintenzionato potrebbe prendere possesso della nostra webcam,potremmo coprirla
            (ad esempio con dello scotch) non e un brutta idea! Comunuque potremmo anche monitorare tutto il
            traffico in entrata ed in uscita sul nostro PC (anche se ci farebbe perdere molto tempo).<br><br>
            Lo stesso discorso pu&ograve; essere applicato al microfono in questo caso (se e possibile) sarebbe
            staccare fisicamente il microfono poich&egrave; anche dissativarlo non sarebbe difficile attivarlo
            se il tuo Sistema &egrave; stato violato.<br><br>

            Il monitoraggio &egrave; fattibile anche su smartphone, &egrave; questo pu&ograve; essere un grosso
            problema poich&egrave; sarebbe inutile andare in giro con un telefono senza microfono e in secondo
            e veramente difficile smontare un telefono senza danneggiarlo.<br>
            Secondo wikipedia il monitoraggio pu&ograve; essere effettuato anche con il telefono privo
            di batteria.L'unica soluzione fattibile sarebbe lasciare il telfono in un microonde il
            quale isola il dispositivo dai campi magnetici.<br><br>

            Veniamo ora alle e-mail che riceviamo: sembrer&agrave; ridicolo dirlo ora, dopo tutto
            quello che abbiamo detto riguardo la sicurezza, ma ATTENZIONE non aprite mai un allegato
            a patto che non conoscete e siete sicuri del mittente.<br><br>

            E per quanto riguarda il Sistema Operativo?<br>
            All'inizio di questo corso abbiamo detto che &egrave; possibile essere relativamente
            sicuri con qualunque Sistema Operativo; tuttavia bisogna considerare che GNU/
            Linux e BSD sono gli unici sistemi operativi a cui si pu&ograve; fare veramente
            affidamento. Mentre OSX e Windows poich&egrave; sono O.S proprietari possono
            contenere non solo Trojan e Virus ma anche exploit di spionaggio oltre a bug
            in risolti poich&egrave; il codice e in mano agli svillupatori proprietari e non alla
            community.<br><br>

            Se avete dubbi su file che non conoscete il mittente apriteli in Virtual Machine cosi
            se ci sar&agrave; un codice malevole vera virtuallizato in un ambiente virtuale fuori
            dal nostro (occhio he per&ograve; esistono codici che riescono a "rompere questo muro" e
            mandare a monte tutto).<br><br>

            Se non vi fidate del vostro BIOS,flashatelo: alcuni virus si insidiano nel Bios
            e ricordatevi che nessun Antivirus riesce ad accederli (l' Antivirus poi funziona solo se
            l'O.S e attivo.)<br><br>

            A proposito degli Antivirus:sono davvero utili? Esistono diverse scuole di pensiero
            ce chi dice che sono importantissimi e altri che li ritengono inutili.
            Diciamo che la funzione di un antivirus si basa sulla statistica cio&egrave; esiste un database
            in continuo aggiornamento dalla community che esegue scansioni eucaristiche sui
            probabili comportamenti di programmi/file. Quello che &egrave; sicuro &egrave; che
            se il dispositivo &egrave; infetto o viene preso di mira da un'agenzia governativa, le
            probabilit&agrave; che un Antivirus se ne accorga sono pari a zero. Inoltre, la maggior
            parte dei virus informatici vengono oggi offuscati e modificati alla sorgente per
            rendere pi&ugrave; difficile se non addiritura nullo.<br><br>

            E con questo non voglio dirvi di non tenerlo protetto anzi, fatte
            in modo che sia l' O.S che i programmi siano sempre aggiornati e funzionanti.
            Ma soprattutto e importatnte che sia configurato in modo che sia sempre sotto il
            nostro controllo.&Egrave; possibile ad esempio che il Sistema abbia una funzione per
            collegarsi automaticamente ad una rete Wifi: basterebbe poco per esporre il
            sistema e compromettere la sicurezza dell'utente.
          </p>
        </div>
        </div>
        <div id="footer">
        <p class="console">
          <a href="pagareonline.html"><span id = "sinistra"> Pagare Online </span></a> |
          <a href = "../index.html"> <span id = "centro">Torna all'indice </span> </a> |
          <a href="ambienti.html"><span id = "destra"> Ambienti Virtualizzati </span></a>
        </p>
        </div>
        </body>
        </html>
